src/InformationRegisters/СтатусыДокументовЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументовЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатусовОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвитанцияДоставлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвитанцияВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОРегистрацииДвижения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ДобавлениеАлкоподукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеВТорговыйЗалЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОбИмпортеПродукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ДобавлениеОрганизацииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПостановкиНаБалансЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПривязкиМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияАлкогольнойПродукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроверкаОстатковМарокВЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОстаткиЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОстаткиМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеГрупповойТарыЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ДальнейшиеДействияЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияЕГАИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеАктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткажитесьОтАктаОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеОстатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеАкцизныеМарки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткажитесьОтНакладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеПроверку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеПолучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеПолучениеАктПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеПолучениеАктРасхождений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеОтменуПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеЗапросНаОтменуПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткажитесьОтЗапросаНаОтменуПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеОперацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеПередачуДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПередачуДанныхРегламентнымЗаданием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеКвитанцииПолученЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеКвитанцииПроведенЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеУведомленияОРегистрацииДвижения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеАкцизныхМарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолученияПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтработайтеРасхождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитеПоступление</Name>
					<Comment>Оформите поступление</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеАктПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершитеФормированиеГрупповойТары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СгенерируйтеКодыУпаковок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеПеремещениеИзТорговогоЗала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПеремещениеИзТЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешитеОтправкуТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеАлкогольнуюПродукцию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеОрганизациюЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеАлкогольнойПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеОрганизацииЕГАИС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыОбработкиСообщенийЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиСообщенийЕГАИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбрабатываетсяЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВУТМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятИзЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПроведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументРаспроведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументОтменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СтатусыОбработкиЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СтатусыОбработкиЕГАИС</Name>
			<Comment>Статусы обработки ЕГАИС</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатусовОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДальнейшееДействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/СтатусыДокументовЕГАИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

// Функция возвращает структуру значений по умолчанию для документа для движений.
//
// Возвращаемое значение:
//	Структура - значения по умолчанию
//
Функция ЗначенияПоУмолчанию(СсылкаНаОформляемыйДокумент) Экспорт
	
	СтруктураЗначенияПоУмолчанию = Новый Структура;
	
	ИмяДокумента = СсылкаНаОформляемыйДокумент.Метаданные().Имя;
	
	СтатусОбработкиПоУмолчанию = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработкиПоУмолчанию(ИмяДокумента);
	
	СтруктураЗначенияПоУмолчанию.Вставить("Документ",          СсылкаНаОформляемыйДокумент);
	СтруктураЗначенияПоУмолчанию.Вставить("СтатусОбработки",   СтатусОбработкиПоУмолчанию.СтатусОбработки);
	СтруктураЗначенияПоУмолчанию.Вставить("ВидСтатуса",        СтатусОбработкиПоУмолчанию.ВидСтатуса);
	
	СтруктураЗначенияПоУмолчанию.Вставить("КвитанцияДоставлена",           Ложь);
	СтруктураЗначенияПоУмолчанию.Вставить("КвитанцияВыполнена",          Ложь);
	СтруктураЗначенияПоУмолчанию.Вставить("УведомлениеОРегистрацииДвижения", Ложь);
	
	СтруктураЗначенияПоУмолчанию.Вставить("ДальнейшееДействие1", СтатусОбработкиПоУмолчанию.ДальнейшееДействие);
	СтруктураЗначенияПоУмолчанию.Вставить("ДальнейшееДействие2", Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	СтруктураЗначенияПоУмолчанию.Вставить("ДальнейшееДействие3", Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	
	Возврат СтруктураЗначенияПоУмолчанию;
	
КонецФункции

// Осуществляет запись в регистр по переданным данным.
//
// Параметры:
//  ДанныеЗаписи - данные для записи в регистр
//
Процедура ВыполнитьЗаписьВРегистр(ДанныеЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.СтатусыДокументовЕГАИС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаписи);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Обработать набор записей регистра.
//
// Параметры:
//  НаборЗаписей - НаборЗаписей.СтатусыДокументовЕГАИС - Набор записей.
//  ПараметрыОбновления - Структура - см. функцию ВозвращаемоеЗначениеДальнейшиеДействияСтатус().
// 
// Возвращаемое значение:
//  Структра - Структура со свойствами:
//   * НовыйСтатус - ПеречислениеСсылка - Новый статус.
//   * СтарыйСтатус - ПеречислениеСсылка - Старый статус.
//   * ЗаписатьНабор - Булево - Признак необходимости записи набора.
//
Функция ОбработатьНаборЗаписей(Документ, НаборЗаписей, ПараметрыОбновления, ЭтоНовый = Истина) Экспорт
	
	НовыйСтатус   = Неопределено;
	СтарыйСтатус  = Неопределено;
	ЗаписатьНабор = Неопределено;
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если ЗаписьНабора.ВидСтатуса <> ПараметрыОбновления.НовыйСтатус Или ЭтоНовый Тогда
			СтарыйСтатус = ЗаписьНабора.ВидСтатуса;
			ЗаписьНабора.ВидСтатуса = ПараметрыОбновления.НовыйСтатус;
			НовыйСтатус = ПараметрыОбновления.НовыйСтатус;
			ЗаписатьНабор = Истина;
			ИмяДокумента = Документ.Метаданные().Имя;
			ЗаписьНабора.СтатусОбработки = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(ИмяДокумента, ЗаписьНабора.ВидСтатуса);
		КонецЕсли;
		Если ЗаписьНабора.ДальнейшееДействие1 <> ПараметрыОбновления.ДальнейшееДействие1 Тогда
			ЗаписьНабора.ДальнейшееДействие1 = ПараметрыОбновления.ДальнейшееДействие1;
			ЗаписатьНабор = Истина;
		КонецЕсли;
		Если ЗаписьНабора.ДальнейшееДействие2 <> ПараметрыОбновления.ДальнейшееДействие2 Тогда
			ЗаписьНабора.ДальнейшееДействие2 = ПараметрыОбновления.ДальнейшееДействие2;
			ЗаписатьНабор = Истина;
		КонецЕсли;
		Если ЗаписьНабора.ДальнейшееДействие3 <> ПараметрыОбновления.ДальнейшееДействие3 Тогда
			ЗаписьНабора.ДальнейшееДействие3 = ПараметрыОбновления.ДальнейшееДействие3;
			ЗаписатьНабор = Истина;
		КонецЕсли;
		Если ПараметрыОбновления.Прочее <> Неопределено Тогда
			Для Каждого КлючИЗначение Из ПараметрыОбновления.Прочее Цикл
				Если ЗаписьНабора[КлючИЗначение.Ключ] <> ПараметрыОбновления.Прочее[КлючИЗначение.Ключ] Тогда
					ЗаписьНабора[КлючИЗначение.Ключ] = ПараметрыОбновления.Прочее[КлючИЗначение.Ключ];
					ЗаписатьНабор = Истина;
					Если КлючИЗначение.Ключ = "ВидСтатуса" Тогда
						ИмяДокумента = Документ.Метаданные().Имя;
						ЗаписьНабора.СтатусОбработки = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(ИмяДокумента, ЗаписьНабора.ВидСтатуса);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("НовыйСтатус",   НовыйСтатус);
	ВозвращаемоеЗначение.Вставить("СтарыйСтатус",  СтарыйСтатус);
	ВозвращаемоеЗначение.Вставить("ЗаписатьНабор", ЗаписатьНабор);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Изменяет и возвращает статус документа ЕГАИС.
//
// Параметры:
//  Документ - ДокументСсылка - Документ ЕГАИС.
//  ПараметрыОбновления - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.СтатусыИнформированияЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//   * Прочее - Структура - Структура со свойствами:
//      ** КвитанцияДоставлена - Булево - Необходимость получения квитанции Получен в ЕГАИС.
//      ** КвитанцияВыполнена - Булево - Необходимость получения квитанции Проведен в ЕГАИС.
//      ** УведомлениеОРегистрацииДвижения - Булево - Необходимость уведомления о регистрации движений.
//  ОбновлятьДвижения - Булево - Признак принудительного обновления движений.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыИнформированияЕГАИС - новый статус документа ЕГАИС.
//
Функция ОбновитьСтатус(Документ, ПараметрыОбновления, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПараметрыОбновления.НовыйСтатус = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка изменения статуса'");
	КонецЕсли;
	
	ЭтоНовый = Ложь;
	НаборЗаписей  = НаборЗаписей(Документ, ЭтоНовый);
	ЗаписатьНабор = НаборЗаписей.Модифицированность();
	
	Результат = ОбработатьНаборЗаписей(Документ, НаборЗаписей, ПараметрыОбновления, ЭтоНовый);
	Если Результат.ЗаписатьНабор <> Неопределено Тогда
		ЗаписатьНабор = Результат.ЗаписатьНабор;
	КонецЕсли;
	НовыйСтатус  = Результат.НовыйСтатус;
	СтарыйСтатус = Результат.СтарыйСтатус;
	
	Если ЗаписатьНабор Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		НаборЗаписей.Записать();
		
		Если СтарыйСтатус <> НовыйСтатус Тогда
			
			ПолноеИмя = Документ.Метаданные().ПолноеИмя();
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
			
			ПараметрыОбновленияСтатуса = ИнтеграцияЕГАИС.ДополнитьПараметрыОбновленияСтатуса(ДополнительныеПараметры);
			
			МенеджерОбъекта.ПриИзмененииСтатусаДокумента(
				Документ,
				СтарыйСтатус, НовыйСтатус,
				ПараметрыОбновленияСтатуса);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НовыйСтатус;
	
КонецФункции

Функция ТекущееСостояние(Документ) Экспорт
	
	ВозвращаемоеЗначение = ЗначенияПоУмолчанию(Документ);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыДокументовЕГАИС.Документ,
	|	СтатусыДокументовЕГАИС.СтатусОбработки,
	|	СтатусыДокументовЕГАИС.ВидСтатуса,
	|	СтатусыДокументовЕГАИС.КвитанцияДоставлена,
	|	СтатусыДокументовЕГАИС.КвитанцияВыполнена,
	|	СтатусыДокументовЕГАИС.УведомлениеОРегистрацииДвижения,
	|	СтатусыДокументовЕГАИС.ДальнейшееДействие1,
	|	СтатусыДокументовЕГАИС.ДальнейшееДействие2,
	|	СтатусыДокументовЕГАИС.ДальнейшееДействие3
	|ИЗ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ГДЕ
	|	СтатусыДокументовЕГАИС.Документ = &Документ");
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, Выборка);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция РассчитатьСтатусыПриПолученииКвитанции(ДокументСсылка, Имя, СтатусОбработки, ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния = Истина) Экспорт
	
	Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийЕГАИС.Ошибка Тогда
		
		ДальнейшиеДействия = Новый Массив;
		Если Имя <> "КвитанцияВыполнена" Тогда
			
			Для Каждого Действие Из ВидыСтатусов.ОшибкаДействия Цикл
				ДальнейшиеДействия.Добавить(Действие);
			КонецЦикла;
			
			Возврат ВозвращаемоеЗначениеДальнейшиеДействияСтатус(ВидыСтатусов.Ошибка, ДальнейшиеДействия, Истина);
			
		Иначе
			
			ВидСтатуса = ВидыСтатусов.ОшибкаПроведения;
			Если ВидСтатуса = Неопределено Тогда
				ВидСтатуса = ВидыСтатусов.Ошибка;
				Для Каждого Действие Из ВидыСтатусов.ОшибкаДействия Цикл
					ДальнейшиеДействия.Добавить(Действие);
				КонецЦикла;
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначениеДальнейшиеДействияСтатус(ВидСтатуса, ДальнейшиеДействия, Истина);
			
		КонецЕсли;
		
	ИначеЕсли СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийЕГАИС.ДокументОтменен
		Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийЕГАИС.ДокументРаспроведен Тогда
		
		ДальнейшиеДействия = Новый Массив;
		Для Каждого Действие Из ВидыСтатусов.ОтменаПроведенияДействия Цикл
			ДальнейшиеДействия.Добавить(Действие);
		КонецЦикла;
		
		Возврат ВозвращаемоеЗначениеДальнейшиеДействияСтатус(ВидыСтатусов.ОтменаПроведения, ДальнейшиеДействия, Истина);
		
	КонецЕсли;
	
	Если ВыполнитьРасчетТекущегоСостояния <> Ложь Тогда
		
		ВыполнитьРасчетТекущегоСостоянияКэш = Истина;
		
		Если ВыполнитьРасчетТекущегоСостояния = Истина Тогда
			ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(ДокументСсылка);
		Иначе
			ТекущееСостояние = ВыполнитьРасчетТекущегоСостояния;
		КонецЕсли;
		
		Прочее = Новый Структура(Имя, Истина);
		ЗаполнитьЗначенияСвойств(ТекущееСостояние, Прочее);
		Обрабатывается = Не ((ТекущееСостояние.КвитанцияДоставлена           Или Не ВидыСтатусов.КвитанцияДоставлена Или (Не ТекущееСостояние.КвитанцияДоставлена И ТекущееСостояние.КвитанцияВыполнена))
		                   И (ТекущееСостояние.КвитанцияВыполнена          Или Не ВидыСтатусов.КвитанцияВыполнена)
		                   И (ТекущееСостояние.УведомлениеОРегистрацииДвижения Или Не ВидыСтатусов.УведомлениеОРегистрацииДвижения));
		
	Иначе
		ВыполнитьРасчетТекущегоСостоянияКэш = Ложь;
	КонецЕсли;
	
	Если (ВыполнитьРасчетТекущегоСостоянияКэш И Не Обрабатывается) Или Не ВыполнитьРасчетТекущегоСостоянияКэш Тогда
		
		ДальнейшиеДействия = Новый Массив;
		Для Каждого Действие Из ВидыСтатусов.ПринятДействия Цикл
			ДальнейшиеДействия.Добавить(Действие);
		КонецЦикла;
		
		Возврат ВозвращаемоеЗначениеДальнейшиеДействияСтатус(ВидыСтатусов.Принят, ДальнейшиеДействия, Истина);
		
	Иначе
		
		ПолноеИмя = ДокументСсылка.Метаданные().ПолноеИмя();
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
		
		ДальнейшиеДействия = Новый Массив;
		
		СтатусыОшибок = МенеджерОбъекта.ВидыСтатусовОшибки();
		Если СтатусыОшибок.Найти(ТекущееСостояние.СтатусОбработки) <> Неопределено Тогда;
			
			ДальнейшиеДействия.Добавить(ТекущееСостояние.ДальнейшееДействие1);
			ДальнейшиеДействия.Добавить(ТекущееСостояние.ДальнейшееДействие2);
			ДальнейшиеДействия.Добавить(ТекущееСостояние.ДальнейшееДействие3);
			
			Возврат ВозвращаемоеЗначениеДальнейшиеДействияСтатус(ТекущееСостояние.СтатусОбработки, ДальнейшиеДействия, Ложь, ТекущееСостояние);
			
		Иначе
			
			Если ВидыСтатусов.КвитанцияДоставлена И Не ТекущееСостояние.КвитанцияДоставлена Тогда
				ДальнейшиеДействия.Добавить(
					Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
			КонецЕсли;
			Если ВидыСтатусов.КвитанцияВыполнена И Не ТекущееСостояние.КвитанцияВыполнена Тогда
				ДальнейшиеДействия.Добавить(
					Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
			КонецЕсли;
			Если ВидыСтатусов.УведомлениеОРегистрацииДвижения И Не ТекущееСостояние.УведомлениеОРегистрацииДвижения Тогда
				ДальнейшиеДействия.Добавить(
					Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеУведомленияОРегистрацииДвижения);
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначениеДальнейшиеДействияСтатус(ВидыСтатусов.Обрабатывается, ДальнейшиеДействия, Ложь, ТекущееСостояние);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусов) Экспорт
	
	ДальнейшиеДействия = Новый Массив;
	
	Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийЕГАИС.Ошибка Тогда
		
		ВидСтатуса = ВидыСтатусов.Ошибка;
		
		Для Каждого Действие Из ВидыСтатусов.ОшибкаДействия Цикл
			ДальнейшиеДействия.Добавить(Действие);
		КонецЦикла;
		
	Иначе
		
		ВидСтатуса = ВидыСтатусов.Принят;
		
		ДальнейшиеДействия = Новый Массив;
		Для Каждого Действие Из ВидыСтатусов.ПринятДействия Цикл
			ДальнейшиеДействия.Добавить(Действие);
		КонецЦикла;
		
	КонецЕсли;
	
	//ИмяДокумента = ДокументСсылка.Метаданные().Имя;
	//НовыйСтатус = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(ИмяДокумента, ВидСтатуса);
	
	Возврат ВозвращаемоеЗначениеДальнейшиеДействияСтатус(ВидСтатуса, ДальнейшиеДействия, Истина);
	
КонецФункции

Функция РассчитатьСтатусыКПередаче(ДокументСсылка, ВидСтатуса) Экспорт
	
	//ИмяДокумента = ДокументСсылка.Метаданные().Имя;
	//НовыйСтатус  = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(ИмяДокумента, ВидСтатуса);
	
	//ИспользоватьАвтоматическийОбмен = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическуюОтправкуПолучениеДанныхЕГАИС");
	
	ДальнейшиеДействия = Новый Массив;
	//Если ИспользоватьАвтоматическийОбмен Тогда
	//	ДальнейшиеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПередачуДанныхРегламентнымЗаданием);
	//Иначе
		ДальнейшиеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ВыполнитеОбмен);
	//КонецЕсли;
	
	ДальнейшиеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеПередачуДанных);
	
	Возврат ВозвращаемоеЗначениеДальнейшиеДействияСтатус(ВидСтатуса, ДальнейшиеДействия, Истина);
	
КонецФункции

Функция ДальнейшиеДействия(Статусы) Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	Если Статусы.ДальнейшееДействие1 <> Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется Тогда
		ВозвращаемоеЗначение.Добавить(Статусы.ДальнейшееДействие1);
	КонецЕсли;
	Если Статусы.ДальнейшееДействие2 <> Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется Тогда
		ВозвращаемоеЗначение.Добавить(Статусы.ДальнейшееДействие2);
	КонецЕсли;
	Если Статусы.ДальнейшееДействие3 <> Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется Тогда
		ВозвращаемоеЗначение.Добавить(Статусы.ДальнейшееДействие3);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Функция НаборЗаписей(Документ, ЭтоНовый)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыДокументовЕГАИС.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ГДЕ
	|	СтатусыДокументовЕГАИС.Документ = &Документ");
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НаборЗаписей = Неопределено;
	Если Выборка.Следующий() Тогда
		
		НаборЗаписей = РегистрыСведений.СтатусыДокументовЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ, Истина);
		НаборЗаписей.Прочитать();
		
		ЭтоНовый = Ложь;
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.СтатусыДокументовЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Документ, Истина);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗначенияПоУмолчанию(Документ));
		
		ЭтоНовый = Истина;
		
	КонецЕсли;
	
	Возврат НаборЗаписей;
	
КонецФункции

Функция СтруктураСтатусы() Экспорт
	
	Статусы = Новый Структура;
	Статусы.Вставить("Принят");
	Статусы.Вставить("Обрабатывается");
	Статусы.Вставить("Ошибка");
	Статусы.Вставить("ОшибкаПроведения");
	Статусы.Вставить("ОтменаПроведения");
	
	Статусы.Вставить("ОшибкаДействия",           Новый Массив);
	Статусы.Вставить("ПринятДействия",           Новый Массив);
	Статусы.Вставить("ОтменаПроведенияДействия", Новый Массив);
	
	Статусы.Вставить("КвитанцияДоставлена",           Истина);
	Статусы.Вставить("КвитанцияВыполнена",          Истина);
	Статусы.Вставить("УведомлениеОРегистрацииДвижения", Истина);
	
	Возврат Статусы;
	
КонецФункции

Функция ВозвращаемоеЗначениеДальнейшиеДействияСтатус(Статус, ДальнейшиеДействия, ОчиститьПрочее = Истина, Прочее = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("НовыйСтатус",         Статус);
	ВозвращаемоеЗначение.Вставить("ДальнейшееДействие1", Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	ВозвращаемоеЗначение.Вставить("ДальнейшееДействие2", Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	ВозвращаемоеЗначение.Вставить("ДальнейшееДействие3", Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	ВозвращаемоеЗначение.Вставить("Прочее");
	
	ВозвращаемоеЗначение.Прочее = Новый Структура;
	ВозвращаемоеЗначение.Прочее.Вставить("КвитанцияДоставлена",           Ложь);
	ВозвращаемоеЗначение.Прочее.Вставить("КвитанцияВыполнена",          Ложь);
	ВозвращаемоеЗначение.Прочее.Вставить("УведомлениеОРегистрацииДвижения", Ложь);
	
	Если Не ОчиститьПрочее Тогда
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение.Прочее, Прочее);
	КонецЕсли;
	
	Индекс = 1;
	Для Каждого ДальнейшееДействие Из ДальнейшиеДействия Цикл
		ВозвращаемоеЗначение["ДальнейшееДействие" + Индекс] = ДальнейшееДействие;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецЕсли
